package atguigu.c.arrays;

/**
 * @author Wint
 * @create 2022-06-21 15:12
 */
public class ArrayTest1 {
    public static void main(String[] args) {
        /*
        面试题目：创建一个长度为6的int型数组，要求取值为1-30，同时元素值各不相同
         */

        /*
        使用工具类输出上面创建的数组元素
         */

        /*
        使用线性查找，找出上述某一元素的索引位置
         */

        /*
        使用二分法查找出上述数组某一元素的索引位置
         */

        /*
        对上述数组进行复制操作，复制出一个完全相同的数组
         */

        /*
        对上述复制的数组进行冒泡排序
         */

        /*
        使用Arrays工具类比较上述几个数组是否相同
         */

        /*
        使用Arrays工具类将上述数组全部填充为0
         */

        /*
        创建一个九九乘法表的数组并输出
         */
    }
}
